###############################################################################
# Created by write_sdc
# Sun Dec 28 05:13:11 2025
###############################################################################
current_design fir_chip
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 10.0000 [get_ports {clk}]
set_clock_transition 0.2000 [get_clocks {clk_sys}]
set_clock_uncertainty 0.1000 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
set_input_delay 1.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {in_0_}]
set_input_delay 3.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {in_0_}]
set_input_delay 1.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {in_1_}]
set_input_delay 3.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {in_1_}]
set_input_delay 1.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {in_2_}]
set_input_delay 3.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {in_2_}]
set_input_delay 1.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {in_3_}]
set_input_delay 3.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {in_3_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_0_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_0_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_10_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_10_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_11_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_11_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_12_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_12_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_13_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_13_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_14_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_14_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_15_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_15_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_16_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_16_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_17_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_17_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_18_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_18_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_19_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_19_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_1_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_1_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_20_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_20_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_21_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_21_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_22_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_22_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_23_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_23_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_24_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_24_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_25_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_25_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_26_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_26_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_27_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_27_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_28_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_28_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_29_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_29_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_2_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_2_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_30_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_30_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_31_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_31_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_3_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_3_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_4_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_4_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_5_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_5_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_6_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_6_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_7_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_7_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_8_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_8_}]
set_output_delay 0.5000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {out_9_}]
set_output_delay 2.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {out_9_}]
set_false_path\
    -from [get_ports {rst}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 15.0000 [get_ports {out_0_}]
set_load -pin_load 15.0000 [get_ports {out_10_}]
set_load -pin_load 15.0000 [get_ports {out_11_}]
set_load -pin_load 15.0000 [get_ports {out_12_}]
set_load -pin_load 15.0000 [get_ports {out_13_}]
set_load -pin_load 15.0000 [get_ports {out_14_}]
set_load -pin_load 15.0000 [get_ports {out_15_}]
set_load -pin_load 15.0000 [get_ports {out_16_}]
set_load -pin_load 15.0000 [get_ports {out_17_}]
set_load -pin_load 15.0000 [get_ports {out_18_}]
set_load -pin_load 15.0000 [get_ports {out_19_}]
set_load -pin_load 15.0000 [get_ports {out_1_}]
set_load -pin_load 15.0000 [get_ports {out_20_}]
set_load -pin_load 15.0000 [get_ports {out_21_}]
set_load -pin_load 15.0000 [get_ports {out_22_}]
set_load -pin_load 15.0000 [get_ports {out_23_}]
set_load -pin_load 15.0000 [get_ports {out_24_}]
set_load -pin_load 15.0000 [get_ports {out_25_}]
set_load -pin_load 15.0000 [get_ports {out_26_}]
set_load -pin_load 15.0000 [get_ports {out_27_}]
set_load -pin_load 15.0000 [get_ports {out_28_}]
set_load -pin_load 15.0000 [get_ports {out_29_}]
set_load -pin_load 15.0000 [get_ports {out_2_}]
set_load -pin_load 15.0000 [get_ports {out_30_}]
set_load -pin_load 15.0000 [get_ports {out_31_}]
set_load -pin_load 15.0000 [get_ports {out_3_}]
set_load -pin_load 15.0000 [get_ports {out_4_}]
set_load -pin_load 15.0000 [get_ports {out_5_}]
set_load -pin_load 15.0000 [get_ports {out_6_}]
set_load -pin_load 15.0000 [get_ports {out_7_}]
set_load -pin_load 15.0000 [get_ports {out_8_}]
set_load -pin_load 15.0000 [get_ports {out_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 20.0000 [current_design]
