###############################################################################
# Created by write_sdc
# Sun Dec 28 05:54:33 2025
###############################################################################
current_design ibex_wrap
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 40.0000 [get_ports {clk}]
set_clock_transition 0.2000 [get_clocks {clk_sys}]
set_clock_uncertainty 0.1000 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_err}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_err}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_gnt}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_gnt}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_rdata_0}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_rdata_0}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_rdata_1}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_rdata_1}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_rdata_2}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_rdata_2}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_rdata_3}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_rdata_3}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_rvalid}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_rvalid}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {debug_req}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {debug_req}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {fetch_enable_0}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {fetch_enable_0}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_err}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_err}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_gnt}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_gnt}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_0}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_0}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_1}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_1}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_2}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_2}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_3}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_3}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_4}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_4}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rdata_5}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rdata_5}]
set_input_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_rvalid}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_rvalid}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {irq_external}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {irq_external}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {irq_nm}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {irq_nm}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {irq_software}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {irq_software}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {irq_timer}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {irq_timer}]
set_input_delay 0.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {test_en}]
set_input_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {test_en}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {alert_minor}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {alert_minor}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {core_sleep}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {core_sleep}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_0}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_0}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_1}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_1}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_2}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_2}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_3}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_3}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_4}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_4}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_5}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_5}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_addr_6}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_addr_6}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_req}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_req}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_wdata_0}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_wdata_0}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_wdata_1}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_wdata_1}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_wdata_2}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_wdata_2}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_wdata_3}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_wdata_3}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {data_we}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {data_we}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_0}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_0}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_1}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_1}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_2}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_2}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_3}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_3}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_4}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_4}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_addr_5}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_addr_5}]
set_output_delay 4.0000 -clock [get_clocks {clk_sys}] -min -add_delay [get_ports {instr_req}]
set_output_delay 12.0000 -clock [get_clocks {clk_sys}] -max -add_delay [get_ports {instr_req}]
set_false_path\
    -from [list [get_ports {rst_n}]\
           [get_ports {scan_rst_n}]]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 15.0000 [get_ports {alert_minor}]
set_load -pin_load 15.0000 [get_ports {core_sleep}]
set_load -pin_load 15.0000 [get_ports {data_addr_0}]
set_load -pin_load 15.0000 [get_ports {data_addr_1}]
set_load -pin_load 15.0000 [get_ports {data_addr_2}]
set_load -pin_load 15.0000 [get_ports {data_addr_3}]
set_load -pin_load 15.0000 [get_ports {data_addr_4}]
set_load -pin_load 15.0000 [get_ports {data_addr_5}]
set_load -pin_load 15.0000 [get_ports {data_addr_6}]
set_load -pin_load 15.0000 [get_ports {data_req}]
set_load -pin_load 15.0000 [get_ports {data_wdata_0}]
set_load -pin_load 15.0000 [get_ports {data_wdata_1}]
set_load -pin_load 15.0000 [get_ports {data_wdata_2}]
set_load -pin_load 15.0000 [get_ports {data_wdata_3}]
set_load -pin_load 15.0000 [get_ports {data_we}]
set_load -pin_load 15.0000 [get_ports {instr_addr_0}]
set_load -pin_load 15.0000 [get_ports {instr_addr_1}]
set_load -pin_load 15.0000 [get_ports {instr_addr_2}]
set_load -pin_load 15.0000 [get_ports {instr_addr_3}]
set_load -pin_load 15.0000 [get_ports {instr_addr_4}]
set_load -pin_load 15.0000 [get_ports {instr_addr_5}]
set_load -pin_load 15.0000 [get_ports {instr_req}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_err}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_gnt}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_0}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_1}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_2}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_3}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rvalid}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_req}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fetch_enable_0}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_err}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_gnt}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_0}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_1}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_2}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_3}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_4}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_5}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rvalid}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_external}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_nm}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_software}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_timer}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {scan_rst_n}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_en}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_capacitance 0.5000 [current_design]
set_max_fanout 20.0000 [current_design]
